Initial Exploration S&P 500

In [5]:
import pandas as pd
SP_500 = pd.read_csv('./Data/raw_data_but_cleaned/sp500_data_filtered_2014.csv', encoding='cp1252') # Loading row data

In [6]:
SP_500.head()

         Date         Open         High          Low        Close      Volume
0  2014-09-18  2003.069946  2012.339966  2003.069946  2011.359985  3235340000
1  2014-09-19  2012.739990  2019.260010  2006.589966  2010.400024  4880220000
2  2014-09-22  2009.079956  2009.079956  1991.010010  1994.290039  3349670000
3  2014-09-23  1992.780029  1995.410034  1982.770020  1982.770020  3279350000
4  2014-09-24  1983.339966  1999.790039  1978.630005  1998.300049  3313850000

In [7]:
SP_500.tail()

,Date,Open,High,Low,Close,Volume
2550,2024-11-05,5722.430176,5783.439941,5722.100098,5782.759766,3768310000
2551,2024-11-06,5864.890137,5936.140137,5864.890137,5929.040039,6329530000
2552,2024-11-07,5947.209961,5983.839844,5947.209961,5973.100098,4925740000
2553,2024-11-08,5976.759766,6012.450195,5976.759766,5995.540039,4666740000
2554,2024-11-11,6008.859863,6017.310059,5986.689941,6001.350098,4333000000

In [8]:
SP_500.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2555 entries, 0 to 2554
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    2555 non-null   object
 1   Open    2555 non-null   float64
 2   High    2555 non-null   float64
 3   Low     2555 non-null   float64
 4   Close   2555 non-null   float64
 5   Volume  2555 non-null   int64
dtypes: float64(4), int64(1), object(1)
memory usage: 119.9+ KB

In [9]:
SP_500.describe()

              Open         High          Low        Close        Volume
count  2555.000000  2555.000000  2555.000000  2555.000000  2.555000e+03
mean   3281.978643  3299.496314  3263.198884  3282.505057  3.996992e+09
std    1053.773495  1059.366021  1048.211061  1054.093085  9.507071e+08
min    1833.400024  1847.000000  1810.099976  1829.079956  1.296530e+09
25%    2365.025024  2370.979980  2352.905029  2363.724976  3.419235e+09
50%    2943.899902  2954.860107  2926.050049  2943.030029  3.810290e+09
75%    4158.180176  4181.584961  4129.655029  4161.969971  4.335450e+09
max    6008.859863  6017.310059  5986.689941  6001.350098  9.976520e+09

In [10]:
SP_500.isnull().sum()

Date      0
Open      0
High      0
Low       0
Close     0
Volume    0
dtype: int64

In [11]:
SP_500.isna().sum()

Date      0
Open      0
High      0
Low       0
Close     0
Volume    0
dtype: int64

In [12]:
SP_500.duplicated().sum()

np.int64(0)

Changing Data column type to "datetime64"

In [13]:
SP_500['Date'] = pd.to_datetime(SP_500['Date'])

In [14]:
SP_500.info() # Changed date to datetime64 type

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2555 entries, 0 to 2554
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    2555 non-null   datetime64[ns]
 1   Open    2555 non-null   float64
 2   High    2555 non-null   float64
 3   Low     2555 non-null   float64
 4   Close   2555 non-null   float64
 5   Volume  2555 non-null   int64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 119.9 KB

Trim the data from a start date September 18 2014

In [21]:
# Filter Data from sep 18 2014 (same has bitcoin)
start_date = "2014-09-18"
SP_500_data_filtered = SP_500[SP_500['Date'] >= start_date]

In [25]:
finish_date = "2024-05-01"
SP_500_data_filtered = SP_500_data_filtered[SP_500_data_filtered['Date'] <= finish_date]

In [26]:
# Convert into a CSV
SP_500_data_filtered.to_csv('./Data/raw_data_but_cleaned/sp500_data_filtered.csv', index=False)

In [27]:
# Validate the filtered data
df = pd.read_csv('./Data/raw_data_but_cleaned/sp500_data_filtered.csv')
df

,Date,Open,High,Low,Close,Volume
0,2014-09-18,2003.069946,2012.339966,2003.069946,2011.359985,3235340000
1,2014-09-19,2012.739990,2019.260010,2006.589966,2010.400024,4880220000
2,2014-09-22,2009.079956,2009.079956,1991.010010,1994.290039,3349670000
3,2014-09-23,1992.780029,1995.410034,1982.770020,1982.770020,3279350000
4,2014-09-24,1983.339966,1999.790039,1978.630005,1998.300049,3313850000
...,...,...,...,...,...,...
2416,2024-04-25,5019.879883,5057.750000,4990.580078,5048.419922,3958050000
2417,2024-04-26,5084.649902,5114.620117,5073.140137,5099.959961,3604140000
2418,2024-04-29,5114.129883,5123.490234,5088.649902,5116.169922,3447450000
2419,2024-04-30,5103.779785,5110.830078,5035.310059,5035.689941,4082470000
2420,2024-05-01,5029.029785,5096.120117,5013.450195,5018.390137,4544170000